{"iron_fist_white": {"bio": "Danny Rand is a brilliant billionaire who traveled to the heavenly city of K'un Lun to master the martial arts. Becoming the latest in a long line of warriors to pick up the mantle of Iron Fist, Rand gained the mystical power to focus his chi – augmenting his fighting skills to superhuman levels. ", "sb": 4, "st": "Concentration", "name": "Iron Fist (Immortal)", "sd": "The Iron Fist has a {0}% chance to reduce enemy Armor by [16982bff]{1}%[-], but these effects are lost if concentration is broken by incoming attacks.", "sn": [21, 0], "video": "2NyOKgvrx30", "sm": 2.3532}, "elektra": {"bio": "Trained in the martial arts since she was an adolescent, then warped into a killer by the secret order of ninjas known as the Hand, Elektra Natchios is one of Earth’s deadliest assassins. Wielding her remarkable agility, skill and precision on her own terms, Elektra has vowed to never again bow to any master.", "sb": 5, "st": "No Loose Ends", "name": "Elektra", "sd": "Elektra's Final Strike now triggers anytime the opponent is below {0}% Health. Additionally, while the opponent is within Final Strike range, Elektra gains [16982bff]{1}%[-] increased Critical Damage.", "sn": [25, 0], "video": "lWZ6RdYknz8", "sm": 14.348}, "cap_america_wwii": {"bio": "As a member of the Greatest Generation, Steve Rogers spent his days in WWII taking down Nazis and battling the infamous Red Skull. This was the era when the legend known as the Sentinel of Liberty was born.", "sb": 10, "st": "Safeguard", "name": "Captain America (WWII)", "sd": "The chance to Perfectly Block all damage increases by up to [16982bff]{1}%[-] while opponents are under beneficial effects.", "sn": [0, 0], "sm": 6.24}, "dr_strange": {"bio": "Neurosurgeon Doctor Stephen Strange's success caused him to hit rock bottom. But the Ancient One elevated him to new heights, as Doctor Strange, Sorcerer Supreme! He is Master of the Mystic Arts, with powerful magic spells at his command. But forget the Flames of the Faltine, the Cloak of Levitation, the Eye of Agamotto – behind all that is a tenacious warrior dedicated to defending the Earth against the darkest mystical adversaries!", "sb": 15, "st": "Counterspell", "name": "Doctor Strange", "sd": "The Sorcerer Supreme automatically counters enemy Status Effects with beneficial countermagic. Spell effectiveness: [16982bff]{1}%[-]!", "sn": [0, 0], "sm": 9.8049}, "spiderman": {"bio": "Peter Parker, a nerdy scientist, leads a secret double life as the Amazing Spider-Man! Swinging through the streets on his webs, he tackles the most despicable criminals of New York City with his spectacular strength, acrobatic skills, and Spidey Sense. All in a day's work for your Friendly Neighborhood Spider-Man!", "sb": 5, "st": "Spider Sense", "name": "Spider-Man (Classic)", "sd": "Increased agility coupled with small stature and a sixth sense for imminent danger make Spider-Man [16982bff]{0}%[-] more elusive.", "sn": [0], "sm": 3.01}, "storm": {"bio": "Mutant, thief, leader, goddess – Ororo Munroe has played many roles in her life. As Storm, she controls all aspects of the weather on an astonishing scale. Tornados, lightning, and blizzards are hers to command. Summoned from her home in Africa by Professor X, Ororo found a new family in the X-Men – and a new role, as a hero.", "sb": 100, "st": "Conduit", "name": "Storm", "sd": "As Power surges and flows through her target, so too do her bolts of lightning, increasing Storm’s Special Damage by up to [16982bff]{1}%[-] based on how full her opponent’s Power Meter is upon impact.", "sn": [0, 0], "sm": 6.94}, "phoenix": {"bio": "Though Jean Grey and the Phoenix Force have long been separated, their bond is unique. More than a mere host, Jean is a part of the Phoenix, as the Phoenix is a part of her. When Jean was brought to the Battlerealm and exposed to ISO-8, the highly mutagenic properties of ISO-8 reopened Jean’s latent connection the universal force of life, and the Phoenix was reborn again, this time into the Contest of Champions!", "sb": 4.2, "st": "Right of the Phoenix", "name": "Phoenix", "sd": "Once per fight when the Phoenix would be knocked out, she immediately becomes invulnerable for {2} seconds, and consumes all of her Phoenix Force charges, regaining [16982bff]{1}%[-] health per charge. After which she gains {0} Phoenix Force charges.", "sn": [0, 0, 2], "video": "1ViX7CTlJ9s", "sm": 0.8749}, "warmachine": {"bio": "James “Rhodey” Rhodes, decorated U.S. Air Force pilot and longtime ally of Tony Stark, combats evil and injustice as the armored War Machine. True to his codename, Rhodes’ armor delivers heavy metal power via its wrist-mounted machine guns and shoulder-mounted artillery cannon.", "sb": 50, "st": "Empty the Clip", "name": "War Machine", "sd": "War Machine readies all remaining ordnance if Health drops below 20%, granting up to {0}% increased Armor and [16982bff]{1}%[-] increased Attack for the next 12 hits.", "sn": [90, 0], "sm": 16.87}, "rogue": {"bio": "Rogue’s ability to absorb the life energy and psyche of others through touch emerged in a traumatizing accident when she was a young girl, where she left the victim in a coma. Though she originally viewed her mutant powers as a curse, she mastered control of them under the tutelage of the X-Men and would become one of the most powerful mutants to date.", "sb": 10, "st": "Psyche Absorption", "name": "Rogue", "sd": "Absorbing the very fabric of enemy psyche, every Life or Power Steal has a [16982bff]{0}%[-] chance to be Critical, increasing the amount absorbed.", "sn": [0], "video": "dKflyKnX2Pk", "sm": 3.7711}, "magneto": {"bio": "The Master of Magnetism, Magneto is one of the most powerful – and iconic – mutants on Earth. As Max Eisenhardt, he experienced unspeakable atrocities. As Magneto, he crusades for the rights of mutants – often at any cost. He commands the forces of magnetism, generating force bolts or manipulating metal at will. Sometimes champion, sometimes fanatic, Magneto has fought with the X-Men as often as he has fought against them.", "sb": 40, "st": "Refraction", "name": "Magneto", "sd": "Magneto bends a dense electromagnetic field around his body to create a personal force field, preventing him from losing more than [16982bff]{1}%[-] Health from a single source.", "sn": [0, 0], "sm": -3.88}, "rhino": {"bio": "Aleksei Sytsevich's life changed the moment he stepped into an experimental suit – and became the rampaging Rhino! What he lacks in brainpower, he makes up in strength, speed, and a thick hide. And whatever you do, don't get him angry – or you'll end up on the wrong side of his razor-sharp horns!", "sb": 15, "st": "Rhino Armor", "name": "Rhino", "sd": "A thick polymer suit enhances Rhino's gamma-based strength and resilience, increasing his Physical Resistance by up to [16982bff]{1}%[-] based on current Health. Additionally, when entering the fight with full Health, Rhino's Armor reduces an additional [16982bff]{0}%[-] incoming attack damage.", "sn": [5, 0], "sm": 8.289}, "black_bolt": {"bio": "Husband of Medusa. Brother of Maximus the Mad. Liege lord of his people. Black Bolt, king of the Inhumans, carries inside him a terrible power. One utterance, one whisper, one hushed sliver of speech from his mouth is enough to unleash a destructive force capable of rending planets in two. Thus the leader of all Inhumans must rule in strength...and silence.", "sb": 6, "st": "Provocation", "name": "Black Bolt", "sd": "Combat tests Blackagar Boltagon's restraint. Each time he is struck by a Critical Hit, he has a chance to gain a permanent Cruelty or Fury Buff and each time he strikes with his own Critical Hits, he has a chance to gain a {2} second Cruelty or Fury Buff. These effects increase Critical Damage or Attack by [16982bff]{1}%[-].", "sn": [0, 0, 6.5], "sm": 2.287}, "maestro": {"name": "Maestro", "bio": "With the power of the Hulk, and the intellect of Bruce Banner, Maestro has survived wars, nuclear attacks and countless assassination attempts from all across time. Now he moves from one timeline to another, defeating any he deems a worthy foe and taking their prized weapons as personal trophies. With so few who could stand against him, Maestro has now set his sights on a much more grand scale. He aims to take over the Contest and prove he is the most powerful champion in all the universe.", "video": "9r9161cSbQs", "st": "ISO Inversion", "sd": "Maestro's control over the Contest allows his Special Attacks to reverse the empowering effects of ISO, reducing all enemy stats by [16982bff]{1}%[-] for {2} seconds."}, "karnak": {"bio": "Karnak Mander-Azur, Inhuman philosopher and Magister of the Second Tower of Wisdom, refused the transformative Terrigen Mists and chose instead to train his body and mind like no other. Through his training, Karnak has gained immense insight into both himself and others, allowing him to see the flaw in all things and strike down his opponents with ruthless physical and mental precision.", "sb": 20, "st": "Second Tower Training", "name": "Karnak", "sd": "Karnak’s Inhuman metabolism and Autonomic Function Control allows him to shrug off non-damaging Debuff effects [16982bff]{1}%[-] faster than normal and reduces damage from Poison by {0}%.", "sn": [65, 0], "video": "-16-hteLkR0", "sm": 4.5253}, "falcon": {"bio": "A former air force pararescue who went on to work with recovering veterans, Sam Wilson aided the legendary Captain America in adjusting to modern life, quickly becoming Cap’s close friend in the process. Using an experimental winged harness, Wilson takes to the skies as the high-flying Falcon.", "sb": 5, "st": "Exo-8", "name": "Falcon", "sd": "Redwing begins each fight immediately ready to go. Additionally, Redwing’s Lock On lasts {2} seconds longer and provides an additional [16982bff]{1}%[-] Critical Hit Chance.", "sn": [0, 0, 2], "video": "pB4JfD63iUY", "sm": 1.7347}, "rocket": {"bio": "Ain’t no thing like Rocket ‘cept Rocket – the Keystone Quadrant’s most notoriously cranky fur ball. He’s a master of gadgets with an affinity for heavy weapons, and is always down for a heist, especially if it involves blowing things up. He may be ornery, but he is extremely loyal to his teammates from The Guardians of The Galaxy. Just don’t call him a Raccoon!", "sb": 10, "st": "Furocity", "name": "Rocket", "sd": "Rocket makes fur fly with up to [16982bff]{1}%[-] increased Critical Hit Rate for every ten consecutive Combo hits.", "sn": [0, 0], "sm": 5.2}, "venom": {"bio": "After Peter Parker rejected a sinister alien symbiote, the extra-terrestrial threat sought revenge by bonding with Eddie Brock, ex-photographer for the Daily Bugle and Peter’s longtime rival. Fueled by their shared hatred of Spider-Man, Brock and the symbiote now use their immense strength and deadly abilities to gain revenge as the fearful Venom.", "sb": 15, "st": "Bloodlust", "name": "Venom", "sd": "Venom’s bloodlust triggers whenever the opponent bleeds, increasing Critical Hit Rate by {0}% and Critical Damage by [16982bff]{1}%[-] for as long as the enemy continues bleeding.", "sn": [20, 0], "video": "jFkgeaj7Wuw", "sm": 15.0844}, "venompool": {"bio": "“Origin story time! Ahem. A long time ago...in a forgotten corner of the Contest, a wise, handsome, kick-butt dude became permanently duct-taped to a weird, alien Venom thingy…”\n“That’sssss not what happened!”\n“Shut up Symbioid, I’m telling the story! Dang. Lost my place. Oh well, anywhoozle, epic story told in haiku! Deadpool Venom mix; Smashed together, best friends; and....Chimichangas?”\n“We must kill the Ssssssspider-Man!”\n“Oh Symby! You’re the funniest. You always crack me up.”", "sb": 20, "st": "Continuity Memory", "name": "Venompool", "sd": "Every {2} seconds, the symbiote known as Venom has a [16982bff]{0}%[-]  chance to access Deadpool’s unique memory and grant him a random beneficial effect for a short time...even if he never actually had that effect in the past...", "sn": [0, 0, 6], "video": "Ad1TdFU-x60", "sm": 3.7712}, "cap_marvel": {"bio": "Air Force pilot Carol Danvers' life changed course when she was caught in an explosion with an alien Kree craft. She gained superhuman powers of strength, flight, and the ability to fire bolts of energy. A member of both the Avengers and the Guardians of the Galaxy, Carol inspires many by living the motto: \"We will be the stars we were always meant to be.\"", "sb": 20, "st": "Energy Absorption", "name": "Captain Marvel", "sd": "Attack is increased by up to [16982bff]{1}%[-] based on stored Power. In addition, blocking partially absorbs energy-based attacks, fueling Captain Marvel's Power Meter.", "sn": [0, 0], "sm": 9.15}, "joe_fixit": {"bio": "Working as an enforcer for organized crime in Las Vegas, the dark incarnation of the Hulk named Joe Fixit is morally ambiguous at best, and downright cruel at worst. Dressed impeccably in his trademark suits, Mr. Fixit enjoys the finer things in life, like money, women, gambling, and gunning down his enemies with his dual Tommy Guns. He may be a weaker version of the Hulk, but he more than makes up for it with his firepower and sinister intelligence.", "sb": 50, "st": "Double Down", "name": "Joe Fixit", "sd": "Mr. Fixit knows how to play the tables and swing the odds in his favor. Each time he rolls on Gambler’s Ruin, he has a [16982bff]{0}%[-] chance to Double Down and gain a second poker suit for {2} seconds.", "sn": [0, 0, 7], "video": "u-VducFy6i0", "sm": 5.2795}, "deadpool_x": {"bio": "Wade Winston Wilson (a.k.a Deadpool) joined X-Force, a black ops team running covert missions to eliminate threats to the muta-- Hold up -- didn’t we do this whole bio thing already? You know, with the other, less-cool version of me? I’m the hot one! That red-suited scab factory just copies Spider-Man! I’ve got skills, suckahs!", "sb": 11, "st": "Duodenum Poke", "name": "Deadpool (X-Force)", "sd": "Permanently bleeding the opponent was granted after poking enemies right in the duodenum, guaranteed to cause Bleed for [16982bff]{1}%[-] Attack over [16982bff]{2}[-] seconds.", "sn": [0, 0, 3], "video": "SztS1rici5w", "sm": 5.8829}, "the_collector": {"name": "The Collector", "video": "VZB7L7TmSFw"}, "gwenpool": {"bio": "Through unknown means, the avid comic reader Gwen Poole was transported into the world of the comics she loves so much, with all of her memories of the \"real\" world intact. Unwilling to remain an extra in her own story, she sets out to make a name for herself and to find a way to pay her internet bill. Maybe she can make some money in this Contest thingy? At least it'll give her something fun to do!", "sb": 90, "st": "Plot Armor", "name": "Gwenpool", "sd": "Gwenpool’s read enough comics to know that the main character doesn’t die, preventing her from losing more than [16982bff]{1}%[-] of her current health per hit from Special Attacks. She also reduces her opponent's Defensive Ability Accuracy, based on her current combo count.", "sn": [0, 0], "video": "i-12Q066bhs", "sm": -3.7711}, "black_panther": {"bio": "As king of Wakanda, T'Challa is a leader, a champion of his people, and under the mantle of the Black Panther, a hero. Possessing extraordinary speed, strength, and fighting skills, he is a formidable opponent. As a scientist, he is one of the smartest people in the Marvel Universe. And as an Avenger, he has defended justice on Earth and in space.", "sb": 15, "st": "Lacerate", "name": "Black Panther", "sd": "T’Challas’ fists give way to cat-like claws, carving limitless lacerations in his targets with a [16982bff]{0}%[-] chance, each dealing [16982bff]{1}%[-] of your Attack as direct damage over {2} seconds.", "sn": [8, 0, 7], "sm": 7.7936}, "u_colossus": {"bio": "During an event known as Fear Itself, the X-Man known as Colossus touched the Crimson Gem of the demon Cyttorak, gaining the demon’s favor in place of his sister Magik. Attaining the same Mystical power that enhanced Juggernaut, Russia’s favorite mutant hero became an Unstoppable artist of destruction.", "sb": 2, "st": "Unstoppable", "name": "Unstoppable Colossus", "sd": "Calling upon the power of Cyttorak, Colossus becomes Unstoppable, shrugging off all enemy attacks for [16982bff]{2}[-] seconds.", "sn": [0, 0, 0], "sm": 0.305}, "wintersoldier": {"bio": "In the heat of World War II, Bucky Barnes gave his life for his country – or so Captain America thought. His frozen body was recovered by the Soviets, who turned him into an unstoppable, fearsome assassin – and their puppet! Freed from Russian control, Bucky now fights on the side of the just and righteous.", "sb": 13, "st": "EMP Upgrade", "name": "Winter Soldier", "sd": "An upgrade to Bucky's bionic arm grants his Critical Hits a {0}% chance to Power Drain his target for [16982bff]{1}%[-] of the target's max power. The amount drained increases based on Critical Hit Damage.", "sn": [15, 0], "sm": 1.81}, "ironman": {"bio": "Genius. Billionaire. Playboy. Philanthropist. Tony Stark may be a visionary, but he didn't realize his life-saving invention would transform him into Iron Man! In his sleek suit, Stark can fly, shoot repulsor rays, and access an array of cutting edge technology to combat the enemies of the Avengers.", "sb": 25, "st": "Arc Overload", "name": "Iron Man", "sd": "Iron Man overloads the Arc Reactor in his chest if Health drops below 15%, briefly extending his life span with a burst of [16982bff]{1}%[-] Armor and Regeneration.", "sn": [0, 0], "sm": 4.33}, "thor_jane_foster": {"bio": "Born a mortal on Midgard, Dr. Jane Foster - a frequent ally of Thor and consulting physician for Tony Stark - has proven herself worthy of wielding the mighty hammer Mjölnir. Taking up the mantle of Thor, Jane now fights to protect the realms from all who would seek to destroy them.", "sb": 17, "st": "All-Mother's Blessing", "name": "Thor (Jane Foster)", "sd": "With Freyja's guidance and Mjölnir's power, Thor lets loose \"That Which Smashes\", dealing guaranteed Critical Hits and dealing [16982bff]{1}%[-] Critical Damage against stunned opponents.", "sn": [0, 0], "video": "-jOWifM1i2s", "sm": 23.0865}, "gambit": {"bio": "Remy LeBeau, raised by thieves on the dark streets of New Orleans was eventually forced to leave that life behind after winning a duel he wasn’t meant to. Gifted with the power to supercharge objects he touches with powerful kinetic force, Gambit now fights alongside his fellow mutants to protect mankind, while also occasionally dipping into his more scoundrel-like nature to pull off a heist here and there.", "sb": 5, "st": "Ragin' Cajun", "name": "Gambit", "sd": "Gambit maintains {1}% of his Kinetic Charges whenever he Busts. Additionally his Prowess Buffs also grant him [16982bff]{0}%[-] increased Critical Damage each.", "sn": [0, 30], "video": "mCosQcFYqGA", "sm": 2.2627}, "kang": {"bio": "THE FINAL VICTORY BELONGS TO YOU, BRAVE SUMMONER. I, KANG THE CONQUERER, PHARAOH OF THE AGES, LORD OF THE TIMESTREAM ITSELF, GENIUS COMMANDER OF ALL TECHNOLOGY IN THE UNIVERSE, ACKNOWLEDGE YOUR POWER… for now. LONG LIVE KANG!", "sb": 25, "st": "Kang Armor", "name": "Kang", "sd": "Kang’s Power level fuels his neuro-kinetic suit of armor, endowing him with up to [16982bff]{1}%[-] Armor based on stored Power.", "sn": [0, 0], "video": "X1GOQ9xMSEg", "sm": 11.3133}, "jean_grey": {"name": "Jean Grey", "bio": "One of the original X-Men, talented telekinetic and telepath Jean Grey flourished under the tutelage of Professor X. But after bonding with the cosmic entity Phoenix, Jean gained access to unlimited energy. Driven mad by her new powers, she became one of the most legendary executioners of the space ways: the Dark Phoenix.", "video": "gFJlowv_Pqk"}, "wolverine": {"bio": "You've heard the stories. You've seen the bloody aftermath. You think you're ready. But nothing – nothing – can prepare you to go toe to toe with the savage Wolverine! One of the fiercest combatants in the Marvel Universe, this mutant is relentless thanks to quick healing, unbreakable adamantium bones, and retractable claws. You think you're ready? You'll never be ready.", "sb": 5, "st": "Cellular Regeneration", "name": "Wolverine", "sd": "Wolverine's natural healing factor accelerates, granting cumulative Regeneration with a fixed {0}% chance to recover [16982bff]{1}%[-] Health.", "sn": [8, 0], "sm": 2.77}, "antman": {"bio": "When the original Ant-Man retired from the job, another man rose to the occasion (err, stole the costume) – Scott Lang! With his somewhat sordid past somewhat behind him, Scott took on the size-changing, ant-communicating abilities of Ant-Man!", "sb": 16, "st": "Pym Gas Control", "name": "Ant-Man", "sd": "Ant-Man subtly alters his size during combat with precise Pym Gas control, granting a [16982bff]{0}%[-] chance for incoming attacks to glance. Glancing Hits cannot be Critical and deal 50% reduced damage", "sn": [0], "sm": 6.54}, "drax": {"bio": "Drax The Destroyer – a fearsome opponent who has faced Thanos, Annihilus, and the Blood Brothers. But the green-skinned warrior started life as Arthur Douglas, a human who lost his family to the evil Thanos. Supercharged by cosmic beings, he became the Destroyer – a rugged brawler and Guardian of the Galaxy!", "sb": 10, "st": "Enthrall", "name": "Drax", "sd": "Fury fascinates The Destroyer, granting a fixed {0}% chance to cumulatively increase Attack by [16982bff]{1}%[-] for {2} seconds with each activation.", "sn": [12, 0, 6], "sm": 5.545}, "guillotine": {"bio": "Born of a mixed French-Algerian heritage, the mysterious Guillotine is the latest in her bloodline to inherit \"La Fleur du Mal\", a mystical sword with dark supernatural powers. Across the centuries, many have wielded the enchanted blade - some for good, some for evil. For the will of the sword is strong, and its thirst for blood is limitless, and many have succumbed to its whispers in their minds. The current Guillotine uses the blade to punish the guilty and keeps the sinister instincts of the sword in check …for now!", "sb": 16.88, "st": "Ancestor's Strength", "name": "Guillotine", "sd": "The Souls of her ancestors empower Guillotine further, granting a {0}% chance to steal [16982bff]{1}%[-] Health for every {2} Souls she possesses.", "sn": [10, 0, 4], "video": "HesofmDNcA4", "sm": 4.989}, "howard": {"bio": "When Howard was whisked away from his detective agency in New York City to the battle realm, he didn't know what to expect. He certainly didn't expect to be shoved into some back warehouse, organizing the Collector's Crystals all day. Well, an insult like this won't just run off this duck's back. He's \"borrowed\" a spare ISO-Loader, made some upgrades, and attached an old friend; his famous Big Freaking Gun. It's time for Howard to introduce these so-called Champions to the ultimate fighting style of his home universe, Quack-Fu!", "sb": 38, "st": "Mash ALL the Buttons!", "name": "Howard", "sd": "Howard frantically mashes buttons on the Loader console and has a [16982bff]{0}%[-] chance to trigger a Self Repair, healing {1}% Max Health, or a Thunderquack, dealing {2}% of his Attack as Energy Damage. Both effects last 7 seconds and are interrupted if Howard is Stunned.", "sn": [0, 20, 135], "video": "e2NWss_g65Y", "sm": 7.3914}, "hood": {"bio": "Always fascinated with super humans, young petty thief Parker Robbins used his gains to help his family, including his ailing mother. When a burglary took an unexpected turn, Parker found himself in possession of a pair of mystical boots and cloak. Struggling to understand the supernatural items, he learned they granted him limited powers, including invisibility and the ability to walk on air. Dubbed \"The Hood\" by the police, Parker soon found himself forced down a darker path, using his newfound powers to start his own criminal empire to ensure the safety of his family.", "sb": 15, "st": "Dark Dealings", "name": "Hood", "sd": "With some help from Dormammu, the Hood learns to better harness his demonic equipment. While his Invisibility is in cool down, the Hood becomes Stun Immune and his basic attacks have a [16982bff]{0}%[-] chance to Steal {1}% of the opponent’s Power.", "sn": [0, 10], "video": "YciMRij-Gt8", "sm": 5.2795}, "moonknight": {"bio": "Avatar? Executioner? Mercenary Marc Spector died in Egypt, under the statue of the ancient deity Khonshu. He returned to life in the shadow of the moon god, and wears his mantle to fight crime for his own redemption. Is he crazy? How would you feel after being resurrected? Listen, sometimes you have to go with the voices in your head.", "sb": 8, "st": "Synodic Tide", "name": "Moon Knight", "sd": "Either Power Gain is enhanced by up to [16982bff]{1}%[-], or enemies suffer [16982bff]{1}%[-] reduced Power Gain. This cycles every {2} hours.", "sn": [0, 0, 6], "video": "DYj7ZYG3M-8", "sm": 4.825}, "vision": {"bio": "An advanced robot created by the nefarious Ultron, the Vision's sophisticated artificial intelligence allows superior thought and strategy in the heat of battle. His resilient body delivers super strength, flight, intangibility, and energy blasts. Fighting on the side of good, the Vision has more than earned his status as the Android Avenger!", "sb": 80, "st": "Synthesis", "name": "Vision", "sd": "The only known Synthezoid, the Vision is capable of synthesizing [16982bff]{1}%[-] Power periodically during battle.\n01001111 01010000 ", "sn": [0, 0], "sm": 55.84}, "red_skull": {"name": "Red Skull", "video": "qBT_RumGaLQ"}, "thanos": {"bio": "Thanos has entered the Collector’s Contest, not to fight, but to rule. Seizing immense power from all avenues that he can get his hands on, the Mad Titan strikes down any who would dare to stand against him. With near immortality and unlimited cosmic power, Thanos sets his sights on seizing the ISO-Sphere so that he may one day gain the affection of his true love, Mistress Death.", "sb": 10, "st": "Immortality", "name": "Thanos", "sd": "Granted near-immortality, Thanos the Mad Titan passively reduces his opponent's base Attack by [16982bff]{1}%[-].", "sn": [0, 0], "sm": 4.5253}, "hulkbuster": {"bio": "Tony Stark, man of means and intelligence, knows what to do when it’s time to battle a raging Hulk – build a Hulkbuster exo-frame to bolster your armor.  Loaded for maximum strength and power with loads of heavy weaponry, this is a must have for anyone looking to SMASH!", "sb": 30, "st": "Iron Rage", "name": "Hulkbuster", "sd": "Hulkbuster's armor is reinforced upon receiving damage, increasing up to [16982bff]{1}%[-] based on lost Health. The perfect counter to the Hulk's Rage!", "sn": [0, 0], "sm": 6.785}, "hyperion": {"bio": "An infant cast into space, Hyperion was the only survivor of a dying race, on a dying world. He crashed to Earth, and was found by a man who called himself Father. Father would teach him right from wrong, good from evil, instilling in him a set of morals which would guide him into using his incredible powers as a sworn protector of our world.", "sb": 25, "st": "Cosmic Potential", "name": "Hyperion", "sd": "Hyperion’s Eternal physiology becomes more efficient at storing and converting cosmic radiation, resulting in [16982bff]{0}[-]% increased Buff duration.", "sn": [0], "video": "Bj-2_E9fbj0", "sm": 3.7711}, "spidergwen": {"bio": "Leaping from an alternate reality in which Peter Parker died and she was bitten by a radioactive spider, Gwen Stacy learned the painful lesson that with great power there must come great responsibility. Attempting to gain redemption for her fallen friend, she now fights crime as the amazing Spider-Woman. It shouldn't be a problem practicing with her band, getting to class on time, and still trying to protect her identity from Police Lieutenant George Stacy – her father! She’s totally got this...right?", "sb": 25, "st": "Enhanced Weave", "name": "Spider-Gwen", "sd": "While in Hunter Spider Mode, Gwen’s critical hits have a [16982bff]{0}%[-] chance to deal double damage. While in Trap Spider Mode, Gwen’s critical hits have a [16982bff]{0}%[-] chance to Weaken foes, lowering their attack by {1}% for {2} seconds.", "sn": [0, 20, 8.5], "video": "fvl1vhbzE7Q", "sm": 2.6398}, "ghost_rider": {"bio": "Tricked by the demonic being Mephisto into selling his soul to save a loved one, stunt cyclist Johnny Blaze soon found himself bonded to the Spirit of Vengeance, a being of almost unlimited power from Hell itself. With the power to control Hellfire as well as his mystical Hell Cycle and Hell Chains, Ghost Rider has turned against Mephisto’s purpose and instead uses his newfound abilities to protect the innocent and cast judgment upon the wicked.", "sb": 25, "st": "Spirit of Veangeance", "name": "Ghost Rider", "sd": "Judgement of Corruption: {0}% chance. \nSecondary: Ghost Rider gains a burst of [16982bff]{1}%[-] Attack for {2} seconds.", "sn": [65, 0, 7.5], "video": "m0YxkB4ZiZM", "sm": 11.3133}, "red_hulk": {"bio": "General Thaddeus “Thunderbolt” Ross has done the unthinkable in his unending mission to hunt down and destroy the Incredible Hulk. Using a combination of radiations, Ross has turned himself into what he hated for so long: a walking weapon of mass destruction. Now, equipped with super strength, durability and the ability to absorb radiation and energy, Thunderbolt Ross struggles with his desire to end the Hulk without succumbing to his own monstrous impulses.", "sb": 6, "st": "Second Strike", "name": "Red Hulk", "sd": "General Ross prepares to cross the line in the sand, beginning the fight with {2} Heat Charge(s) ready. Additionally, for every 2 Heat Charges he has, he gains an additional [16982bff]{1}%[-] Physical Resistance.", "sn": [0, 0, 2], "video": "QlUz6_N4UZo", "sm": 2.5644}, "colossus": {"bio": "Piotr \"Peter\" Rasputin was the child of Russian farmers, born with big shoulders and strong spirit. When his mutant powers emerged, his body became encased in living steel and he became one of the mightiest heroes of the Marvel Universe. Peter moved to America to join the X-Men, serving as both the heart and conscience of the team.", "sb": 7, "st": "Organic Steel", "name": "Colossus", "sd": "Piotr’s organic metal skin shapes and strengthens to his will with no limit, increasing Armor by [16982bff]{1}%[-] with a fixed {0}% chance.", "sn": [7, 0], "sm": 3.87}, "punisher": {"bio": "I know what you're thinking. How did I end up like this? Tied to a chair in a dingy warehouse, with a big, scary man pointing a big, scary gun in my face. Well let me tell you: you're here because you're a criminal. You're a tumor of society. And me? I'm just a man who loves his job. I'm the Punisher. And we're about to have a lot of fun together...", "sb": 30, "st": "Defy Pain", "name": "Punisher", "sd": "Marine Corps. The Vietnam War. The Italian Mafia. Frank Castle has conditioned himself for high pain tolerance, granting him a [16982bff]{0}%[-] chance to endure a lethal blow.", "sn": [0], "sm": 8.29}, "spiderman_morales": {"bio": "In an alternate reality where Peter Parker died while protecting his friends and family, teenager Miles Morales was bitten by a genetically enhanced spider and discovered that he now possessed the same powers as his fallen idol. With the world mourning the loss of one of their greatest heroes, Miles decided to take on the mantle of Spider-Man. Miles knows that with great power must come great responsibility, but can he live up to the legacy set before him?", "sb": 5, "st": "Spider Sense", "name": "Spider-Man (Miles Morales)", "sd": "Miles’ self-training and newfound experience in the Contest grants a [16982bff]{0}%[-] chance to trigger an additional Venom Blast after using a Light or Medium Combo-ender. Longer combos grant a higher chance to trigger a Venom Blast, up to a max of 5 hits.", "sn": [0], "video": "FeC7B00D0_Q", "sm": 1.5084}, "civil_warrior": {"bio": "There are many rumors about the origin of the mysterious Civil Warrior… legend says he is a Captain America from an alternate Earth ravaged by the Civil War between his own army and Iron Man’s forces. On that world, the two heroes mortally wounded each other in the final battle of the war; Steve survived, but Tony didn’t. Riddled with guilt for the battle’s destruction and the death of his former ally at his own hands, he assumed the mantle of the Civil Warrior. Adding Tony’s ARC technology to his Captain America gear, he vowed to use his friend’s legacy to stop this senseless conflict from ever happening again.", "sb": 9, "st": "Arc Shield", "name": "Civil Warrior", "sd": "An upgrade to Civil Warrior’s Arc Shield grants him {2} Armor Up charges at the start of the fight. Additionally, he receives [16982bff]{1}%[-] Special Damage resistance while Blocking.", "sn": [0, 0, 2], "video": "4_Dtz3Izu0s", "sm": 1.6593}, "black_panther_cw": {"bio": "The prince of the reclusive but technologically advanced African nation Wakanda, Prince T’Challa’s birthright is not only to rule but to don the mantle of the Black Panther, a powerful warrior and symbol to his people. T’Challa will aggressively defend his country and citizens against any threat, no matter how menacing.", "sb": 15, "st": "Unstoppable", "name": "Black Panther (Civil War)", "sd": "Black Panther begins the fight with his Reflective state active. Additionally, Black Panther's Armor passively has a [16982bff]{0}%[-] chance to absorb heavy attack impacts by consuming {1} Armor Up effects.", "sn": [0, 1], "video": "LQgIjCVZs9s", "sm": 3.6353}, "scarlet_witch_ultimate": {"name": "Scarlet Witch Ultimate", "bio": "Sister to Quicksilver, Wanda Maximoff a.k.a. The Scarlet Witch is a true master of chaos magic utilizing a deep understanding of mathematics to ensure success as she brandishes her amazing talents for probability manipulation and reality warping.", "st": "Veil of Fortune", "sd": "Whenever a Critical Hit occurs for either player, there's a [16982bff]{0}%[-] chance the Scarlet Witch manipulates the outcome for her benefit."}, "daredevil": {"bio": "The Man Without Fear, a lawyer without sight. As a child, Matt Murdock had a chance encounter with radioactive waste. It caused him to go blind, but enhanced his remaining senses – and granted him a sharp superhuman radar. With his passion for justice and enhanced strength, Daredevil protects the streets of his native New York City.", "sb": 20, "st": "Radar Sense", "name": "Daredevil (Classic)", "sd": "With acute sensory perception more attuned than even Spider-Man, Daredevil evades projectiles with a [16982bff]{0}%[-] chance.", "sn": [0], "sm": 12.0675}, "cable": {"bio": "Nathan Summers was a child of destiny even before his birth. His parents, Scott Summers and Madelyne Prior, were manipulated into having him by Mister Sinister, in an attempt to create a genetically superior mutant as his ultimate weapon. As an infant, he was instead infected with the deadly Techno Organic Virus and sent 2000 years into the future to save his life. Years later he would return, taking the name Cable to represent his unique place as a link between the present and the future.", "sb": 20, "st": "Techno Organic Virus Suppression", "name": "Cable", "sd": "Cable's immense mutant power are hampered by having to constantly keep the techno organic virus in check. As the strength of the virus wanes, Cable has a [16982bff]{0}%[-] chance gain {1}% Power over 10 seconds each time he fills a bar of power.", "sn": [0, 16.5], "video": "gNwVO__dH-I", "sm": 3.0169}, "she_hulk": {"bio": "When a bullet meant for her father struck Jennifer Walters, it seemed that all was lost. Bleeding out and in desperate need of a donor for her rare blood type, it was her cousin Bruce Banner that stepped forward to save her. When the Hulk’s gamma-infused blood was introduced into Jennifer, she found herself able to transform into the powerful She-Hulk! Standing as her own hero, She-Hulk has fought alongside the world’s greatest warriors, using her immense strength and intellect to defeat the villains of earth, both in the courtroom and on the battlefield.", "sb": 5, "st": "Citing Precedent", "name": "She Hulk", "sd": "Jennifer Walters relentless studying and research on her opponent allows her to place a Passive effect on them, reducing a specific stat by [16982bff]{1}%[-] based on which Class they are.", "sn": [0, 0], "video": "F1LzfPe9-Po", "sm": 2.2627}, "wolverine_weaponx": {"name": "Wolverine Weapon X", "bio": "You've heard the stories. You've seen the bloody aftermath. You think you're ready. But nothing – nothing – can prepare you to go toe to toe with the savage Wolverine! One of the fiercest combatants in the Marvel Universe, this mutant is relentless thanks to quick healing, unbreakable adamantium bones, and retractable claws. You think you're ready? You'll never be ready.", "video": "vt6RAqdY2VY", "st": "Berserker Rage", "sd": "A wild, animal-like rage envelopes The Wolverine, suspending Regeneration for [16982bff]{1}%[-] increased Attack during Special Attacks."}, "quake": {"bio": "When she was a teenager, Daisy Johnson, alias Quake, had her earth-shaking powers accidentally awakened as a result of her mother’s Inhuman lineage. Her devastating powers caught the attention of S.H.I.E.L.D., and Nick Fury took her under his wing to train and mentor her. Her ability to target seismic waves with pinpoint accuracy makes her one of S.H.I.E.L.D.’s most skilled and powerful agents.", "sb": 7.5, "st": "Ricochet Pulse", "name": "Quake", "sd": "Quake Blocks an additional [16982bff]{1}%[-] Damage and Redirects it back to the opponent as a pulse of Physical Damage.", "sn": [0, 0], "video": "v83kUcjIp5U", "sm": 3.394}, "iron_patriot": {"bio": "Don’t be fooled by the Captain American veneer on an Iron Man-esque armor, this Iron Patriot is not what he seems. Why? Because inside the heroic armor lurks the notoriously maniacal and scheming Norman Osborn. He’s locked and loaded to take down anyone that gets in his way during his Dark Reign on The Contest.", "sb": 18, "st": "Arc Overload", "name": "Iron Patriot", "sd": "Norman Osborn overloads the Arc Reactor in his chest if Health drops below {0}%, granting a large burst of power, with [16982bff]{1}%[-] Armor, Regeneration, and Power Gain. After that, his suit burns out and cannot trigger Armor Up, Armor Break or Stun and loses all base Armor.", "sn": [10, 0], "sm": 4.52}, "hawkeye": {"bio": "Clint Barton – a regular guy amongst super soldiers, armored geniuses, and gods of thunder. Known as the World's Greatest Marksman, he's mastered the bow and arrow, and the ability to transform nearly any projectile into an accurate weapon. Tenacious, brave, and heroic, Hawkeye stands tall amongst the mighty Avengers!", "sb": 324, "st": "Hemorrhage", "name": "Hawkeye", "sd": "Arrows strike the jugular with a fixed {0}% chance to inflict severe Bleeding, dealing [16982bff]{1}%[-] of your Attack per minute as direct damage.", "sn": [25, 0], "sm": 132.505}, "luke_cage": {"bio": "Framed and sent to prison for a crime he didn’t commit, Carl Lucas became the “volunteer” for a series of scientific experiments to create another Super-Soldier. When a sadistic prison guard intervened with the experiment, Lucas was granted superhuman strength and near-impenetrable skin. Using his newfound abilities to escape prison, Carl changed his name to Luke Cage and set up shop as a Hero for Hire, vowing to assist any who needed his help…for the right price.", "sb": 1.5, "st": "Tough it Out", "name": "Luke Cage", "sd": "The first time Luke Cage is struck during a fight, his bullet-proof skin allows him to become Indestructible and ignore all incoming damage for [16982bff]{2}[-] seconds.", "sn": [0, 0, 0], "video": "MSrEgG8q8bM", "sm": 0.3017}, "cyclops90": {"bio": "As a straight-laced youth, Scott Summers was recruited into the first generation of X-Men by Professor Xavier. Projecting forceful optic blasts from his eyes, he is a formidable defender of mutantkind. Working alongside his fellow X-Men as their tactically-minded leader, Cyclops works hard to protect mankind both from itself and from the Mutants who have joined the human-hating Brotherhood led by Magneto.", "sb": 45, "st": "Expertise", "name": "Cyclops (Blue Team)", "sd": "Beams are calibrated for up to [16982bff]{1}%[-] increased Critical Hit Damage. As long as a Combo of 10 or more hits is maintained, Cyclops’ Armor Break effects have {0}% increased Duration and as long as a Combo of 20 or more hits is maintained Beam Attacks break through an enemy’s Block. ", "sn": [20, 0], "video": "oO7RCY73chM", "sm": 21.8724}, "magneto_white": {"bio": "The Master of Magnetism has embraced a self-proclaimed role of detective, judge, jury, and executioner against those who harm mutants. One of the greatest Marvel anti-heroes ever, Magneto exacts his own form of mutant justice, by any means necessary.", "sb": 20, "st": "Urgent Refraction", "name": "Magneto (Marvel Now!)", "sd": "Triggered when his health is low, Magneto bends a dense electromagnetic field around his body to create a personal force field, preventing him from losing more than [16982bff]{1}%[-] Health from a single source.", "sn": [0, 0], "sm": -1.95}, "thor": {"bio": "The mighty Thor is Asgard's finest and bravest warrior. With god-like strength, command over lightning, and the aid of the legendary hammer Mjölnir, Thor defends Earth alongside his battle-worthy companions, the Avengers. However, Thor must often contend with the evil schemes of his own brother, the nefarious Loki.", "sb": 30, "st": "Ragnarok", "name": "Thor", "sd": "Stunning the Thunder God infuriates him, increasing his Attack by {0}% for {2} seconds. Additionally, Stunning his opponents tears apart enemy Armor, reducing it by [16982bff]{1}%[-].", "sn": [30, 0, 4.5], "sm": 16.64}, "iron_fist": {"bio": "Danny Rand is a brilliant billionaire who traveled to the heavenly city of K'un Lun to master the martial arts. Becoming the latest in a long line of warriors to pick up the mantle of Iron Fist, Rand gained the mystical power to focus his chi – augmenting his fighting skills to superhuman levels. ", "sb": 4, "st": "Focus", "name": "Iron Fist", "sd": "The Iron Fists' repeated strikes to pressure points wreak cumulative havoc on the target’s Armor, with a {0}% chance to reduce it by [16982bff]{1}%[-] for each activation.", "sn": [21, 0], "sm": 1.8}, "kamala_khan": {"bio": "Self-proclaimed nerd and massive Captain Marvel fan Kamala Khan discovered something utterly amazing when the Terrigen mists fell upon her hometown of Jersey City. The cosmic mists reacted to her Inhuman DNA, triggering her superhuman transformation through the process that the Inhumans call Terrigenesis. Kamala soon discovered she had amazing powers to stretch and alter her body, which she now uses to protect others, just like her hero, Carol Danvers.", "sb": 2, "st": "Morphogenetics", "name": "Ms. Marvel (Kamala Khan)", "sd": "Ms. Marvel starts to figure out this whole Contest thing, increasing her Fury durations by [16982bff]{2}[-] seconds and increasing the Potency of her Fury effects by {1}%.", "sn": [0, 10, 0], "video": "CJSDYAESa38", "sm": 0.8296}, "grandmaster": {"name": "Grandmaster", "video": "KhxYENWhO2U"}, "black_widow": {"bio": "There’s no escaping the sting of the world’s greatest spy when she has you in her sights. A skilled fighter possessing astounding agility and a way with weapons, she is often shrouded in mystery. But there’s no mystery as to who you want on your team when things start heating up – Natasha Romanova – The Black Widow!", "sb": 10, "st": "Subtlety", "name": "Black Widow", "sd": "Black Widow strikes her targets with subtle, calculated grace, reducing the chance of triggering their abilities by [16982bff]{1}%[-].", "sn": [0, 0], "sm": 13.585}, "scarlet_witch": {"bio": "Cast no evil eyes in the direction of Wanda Maximoff, aka the Scarlet Witch – the master of chaos magic. Her powerful hexes influence probability – making the impossible erupt across reality. A former member of the Brotherhood of Evil Mutants, she is a long-time member of the Avengers. Wanda remains close with her twin brother, Quicksilver.", "sb": 16, "st": "Veil of Fortune", "name": "Scarlet Witch", "sd": "Whenever a Critical Hit occurs for either player, there's a [16982bff]{0}%[-] chance the Scarlet Witch triggers her chaos magic, generating 0 - 8 Buffs or Debuffs.", "sn": [0], "sm": 12.6709}, "loki": {"bio": "I know what they say. They called me the god of mischief, but that lacks a certain...imagination. Don't you think? My father Odin, and my brother Thor are so dull, monotonous. Am I good? Evil? Noble? Nonsense. Call me not mischievous – I merely see the world not as it is, but how it could be. Call me a visionary. Call me Loki.", "sb": 6.6, "st": "Ascendant", "name": "Loki", "sd": "Rising in power through sorcery and subterfuge, Loki generates an additional [16982bff]{1}%[-] Power per second as long as he is below {2} bars.", "sn": [0, 0, 1], "video": "o56w40X68C0", "sm": 1.5084}, "cyclops": {"bio": "The ultimate X-Man. The ultimate traitor. As a straight-laced youth, Scott Summers was recruited into the first generation of X-Men by Professor Xavier. Projecting forceful optic blasts from his eyes, he was a formidable defender of mutantkind. But after murdering Xavier under control of the Phoenix Force, Summers has gone from exemplar to pariah, founding his own underground mutant school away from his one-time allies.", "sb": 45, "st": "Expertise", "name": "Cyclops (New Xavier School)", "sd": "Beam attacks are calibrated for up to [16982bff]{1}%[-] increased Critical Damage. Damage from Beam attacks is not reduced by Blocking once a Combo of 15 or more hits is reached.", "sn": [0, 0], "sm": 21.8724}, "electro": {"bio": "Max Dillon was just an electrical engineer doing his job. But a lightning strike jolted him into the menacing supervillain known as Electro! With the ability to command up to a million volts of electricity, deliver lethal shocks, or shoot lightning, he has become an infamous criminal, and adversary to Spider-Man.", "sb": 16, "st": "Electrostatic", "name": "Electro", "sd": "Building Power levels in both players charge the atmosphere, increasing Critical Hit Rate by up to [16982bff]{1}%[-] based on the stored Power in both Electro and his opponent.", "sn": [0, 0], "sm": 12.6709}, "yellowjacket": {"bio": "After learning the science behind Hank Pym’s astonishing shrinking suit, the ruthless tech mogul Darren Cross devoted his resources to creating a prototype suit with similar abilities. Cross envisioned this high-power cybernetic rig as a means to take modern warfare to a new level, personally overseeing its retrofitting and weaponization. Cross dons the imposing armor himself in hopes of achieving final victory as Yellowjacket!", "sb": 1, "st": "Biosting 2.0", "name": "Yellowjacket", "sd": "Power Stings stun their victims with a bio-electric shock for [16982bff]{2}[-] second(s) after lasting their full duration.", "sn": [0, 0, 0], "sm": 0.2}, "cap_america": {"bio": "Steve Rogers' body may have been too weak to become a soldier, but his heart was too strong to quit. By a miracle of science, Steve was transformed into Captain America, Sentinel of Liberty. Possessing super strength, speed, reflexes, and his unbreakable shield, Cap is a born leader of humans, heroes, and gods.", "sb": 10, "st": "Last Stand", "name": "Captain America", "sd": "The chance to Perfectly Block all damage increases by up to [16982bff]{1}%[-] based on lost Health, providing hope when the Cap needs it most.", "sn": [0, 0], "sm": 6.24}, "superior_ironman": {"bio": "Tony Stark has always had an impressive ego, but following an inversion spell during the “Axis” event which brought out the worst aspects of his personality, he moved to San Francisco with a new brand of self-worth. To reflect his latest \"superior\" outlook, he built the Model 51, a liquid suit of adaptive Armor based off the Cosmic entities known as symbiotes.", "sb": 25, "st": "Arc Overload", "name": "Superior Iron Man", "sd": "Iron Man overloads the Arc Reactor in his chest if Health drops below 15%, briefly extending his life span with a burst of [16982bff]{1}%[-] Armor and Regeneration.", "sn": [0, 0], "sm": 4.335}, "star_lord": {"bio": "Hey, what's going on? Oh, you're on Earth? Wow, bummer city. I mean, I grew up on Earth, and it's cool and all, but...space, man, is the place. I got ships, I got my Element Gun, I got the babes...I rule. Down there, I was a loser. Up here, I am the Legendary Star-Lord!", "sb": 20, "st": "Tactician", "name": "Star-Lord", "sd": "As blows are exchanged, Star-Lord familiarizes with opponents' techniques, increasing Attack by up to [16982bff]{0}%[-] with every ten of his Combo hits and Block Proficiency by up to {1}% with every ten of theirs.", "sn": [0, 20], "sm": 4.5253}, "dormammu": {"snx": [100, 0, 10], "bio": "Dormammu was born to a race of powerful energy beings known as the Faltine, and has only one true desire, power. This desire saw him forced to flee his home dimension, and eventually ascend to rule the Dark Dimension. Here he draws even greater power from the worship of his subjects, and is quite possibly the greatest mystical threat in the universe. Now with the power of so many heroes concentrated in the Contest, Dormammu has come, doubtless to gain that power for himself.", "video": "ZWVyMUBr5uE", "st": "Soul Leech", "smx": 15.0844, "sbx": 50, "name": "Dormammu", "sd": "Dormammu uses his opponent’s powers as a link to reach deep within their soul. Each time a buff expires on his opponent Dormammu has up to a {0}% chance to degen them for [16982bff]{1}%[-] of his attack, over {2} seconds. The chance of this ability triggering increases the longer it’s been since it was last triggered."}, "ultron_classic": {"bio": "TREMBLE, PATHETIC HUMAN! I AM ULTRON, THE METAL MENACE! BEHOLD, THE MOST ADVANCED ARTIFICIAL INTELLIGENCE KNOWN, ENCASED IN AN UNSTOPPABLE ADAMANTIUM EXOSKELETON! I AM SUPERIOR IN EVERY WAY TO YOUR MEEK FLESH-BASED EXISTENCE – ESPECIALLY MY PATHETIC \"FATHER\" HANK PYM AND THE WEAKLING AVENGERS! PREPARE FOR EXTINCTION, HUMANITY! ALL HAIL THE AGE OF ULTRON!", "sb": 5, "st": "Nano-Inhibitors", "name": "Ultron (Classic)", "sd": "For each Armor Up effect active, Ultron releases more Nano-Inhibitors, reducing his opponent's Offensive Ability Accuracy by [16982bff]{1}%[-] per stack.", "sn": [0, 0], "video": "CgodPNHnOtA", "sm": 3.0169}, "deadpool": {"bio": "Hey, you wanna be cool like me? Then put down the stupid video game and get off your sorry butt! Oh, get cool red threads, big guns, and train like a billion hours until you're a master of sword, fist, and firearm. If you think you REALLY got what it takes, then annoy Wolverine and live to tell the tale! Fat chance gamer. There's only one 'Merc with a Mouth!", "sb": 24, "st": "Healing Factor", "name": "Deadpool", "sd": "Permanently regenerating [16982bff]{1}%[-] Health per minute was granted when the natural healing factor of Wolverine was implanted into Deadpool. Amount increases based on current Power level.", "sn": [0, 0], "sm": 14.481}, "groot": {"bio": "“I am...Groot. I am Groot! I am…”\n“Yeah, thanks for that – listen, Rocket here. There’s only four things you gotta know about Groot. Number one, he’s a walking tree from some far away planet…”\n“I am Groot!”\n“Sorry, ‘Flora Colossus’, not ‘tree person’. Geez. Number two, he’s real kind and passive until you make him mad. Three, he can only say three words; try and guess which ones? And four, me and him have been together forever. You mess with him, and you mess with me, and my really big gun.”", "sb": 20, "st": "Gentle Giant", "name": "Groot", "sd": "Groot grows tired of watching his friends get hurt in combat and begins the fight with {2} Pacifism charges. Additionally, each Fury stack gained from throwing off his gentle nature has a [16982bff]{0}%[-] chance to activate a charge of Cruelty, increasing Critical Hit Damage by {1}% each.", "sn": [0, 25, 2], "video": "mO3nzg7Pfzk", "sm": 6.79}, "ms_marvel": {"bio": "Former Air Force pilot, Kree-enhanced warrior, and manipulator of cosmic energy, Carol Danvers has seen her fair share of incarnations. And while she has now proudly earned the mantle of Captain Marvel, fans will also happily remember her time as the original Ms. Marvel!", "sb": 20, "st": "Energy Absorption", "name": "Ms. Marvel", "sd": "Attack is increased by up to [16982bff]{1}%[-] based on stored Power. In addition, blocking partially absorbs energy-based attacks, fueling Ms. Marvel's Power Meter.", "sn": [0, 0], "sm": 9.149}, "ronan": {"bio": "Judge. Jury. Executioner. Ronan the Accuser is the Head Accuser of the Kree Empire, the right hand of the Supreme Intelligence. He is the ultimate soldier, a strategic genius, and a relentless champion of justice. Wielding the Universal Weapon, Ronan brings his hammer down upon the unjust, wherever they may hide across the cosmos.", "sb": 10, "st": "Edict", "name": "Ronan", "sd": "The Supreme Accuser judges the target, punishing them for their use of beneficial effects with [16982bff]{1}%[-] increased Attack and Stun durations.", "sn": [0, 0], "sm": 6.24}, "crossbones": {"bio": "Once a high-level agent at S.H.I.E.L.D., Brock Rumlow revealed his true colors as an enforcer for HYDRA when the evil agency threatened to destroy S.H.I.E.L.D. from within. Since the climactic battle, the dangerous mercenary now calling himself Crossbones has hidden underground, striking from the shadows and selling his skills to the highest bidder.", "sb": 15, "st": "Hydra Training", "name": "Crossbones", "sd": "Whenever Brock Rumlow gains a Debuff, his brutal Hydra training kicks in and allows him a [16982bff]{0}%[-] chance to shrug it off and convert it to a Fury effect. This chance is increased by {1}% while fighting Science champions, and decreased by {1}% while fighting Mutant champions.", "sn": [0, 15], "video": "MLEXY7jfpr8", "sm": 1.5084}, "magik": {"bio": "Mutants are known to be mysterious and strange, yet Illyana Rasputina may be the most uncanny of them all. As Magik, she can teleport anywhere in the world (and occasionally, anywhere in time). As the Darkchilde, she is the sorceress supreme of the demon world Limbo, and wielder of the terrifying Soulsword. Illyana is sister to Colossus, best friend to Kitty Pryde, and a strict instructor at Cyclops' mutant school.", "sb": 1, "st": "Darkchyld", "name": "Magik", "sd": "After filling a bar of Power, Magik has a 20% chance to enter a state of Limbo for {2} seconds. The chance increases by 12.5% after filling 2 bars, and by 25% after filling 3 bars.\n\nBased on current Signature Level, chances are increased by [16982bff]{0}%[-].", "sn": [0, 0, 3], "sm": 14.9336}, "beast": {"snx": [0, 0, 5], "bio": "One of the world's experts on mutations and evolutionary human biology, Hank was born a mutant with unusually large hands and feet. Later in life, Hank took a hormonal extract that caused him to grow fangs, pointed ears and fur all over his body. He was now a Beast in body, as well as in name.", "video": "OvkSb2MZy44", "st": "Chain Combo", "smx": [0.0453, 0.7693], "sbx": [1.5, 28, 1.8, 33.1], "name": "Beast", "sd": "While in [d957ff]Freestyle[-] combat form, performing a Medium hit followed by a Light, Light, Light and Medium combo inflicts Direct damage per blow for up to [16982bff]{1}%[-] of your Attack based on Signature level. Successfully completing the combo increases Beast’s Critical chance by 25% for {2} seconds.\n\nWhile in [28e3bf]Acrobatic[-] combat form, Blocking an attack followed by a Medium, Light, Light, Medium combo Regenerates up to [16982bff]{0}%[-] of Beast’s maximum Health per move, based on Signature level. Additionally on Combo Success, opponents get 50% less Power when getting hit, and Beast has an extra 5% chance to evade physical hits for {2} seconds.\n\nWhen unsuccessfully performing a combo, there will be a {2} second delay before you can start a new combo."}, "modok": {"name": "M.O.D.O.K.", "bio": "The terrifying result of an unspeakable experiment, M.O.D.O.K. is a grotesque mastermind bent on the destruction of the world. As the sometimes-leader of A.I.M., the Mechanized Organism Designed Only for Killing has tangled many times with his foes, Captain America and the Avengers.", "video": "e8DLpwzi8a4"}, "daredevil_netflix": {"bio": "Matt Murdock grew up around crime, corruption and violence. After a freak accident involving radioactive waste took his sight, Matt was trained by the mysterious martial artist Stick to condition his body to near perfection and hone his remaining senses to superhuman levels.\nPlay as the Man Without Fear equipped with the red suit inspired by Marvel’s Daredevil, a Netflix Original Series.", "sb": 15, "st": "World on Fire", "name": "Daredevil", "sd": "The son of Battlin’ Jack Murdock only becomes more determined as he takes punishment, granting him [16982bff]{1}%[-] increased Critical Hit Rate for {2} seconds each time the opponent places a detrimental effect on him.", "sn": [0, 0, 6], "video": "ldYw53LUc5M", "sm": 3.7711}, "gamora": {"bio": "'The most dangerous woman in the galaxy' is a title hard to earn, and harder to keep. But Gamora has brawled and battled her way across the cosmos enough times to make that title stick. She's stronger than you, faster than you, and tougher than anyone. She is the adopted daughter of Thanos, but fiercely loyal to her comrades in the Guardians of the Galaxy.", "sb": 10, "st": "Assassination", "name": "Gamora", "sd": "A [16982bff]{0}%[-] chance Gamora's Godslayer blade deals a lethal blow, striking for massive Critical Hit Damage.", "sn": [0], "sm": 6.0338}, "wolverine_x23": {"bio": "Years after the original Weapon X program created Wolverine, a top secret plan was put in motion to duplicate the results to create the ultimate killing machine. Using damaged DNA from Logan, a female clone was created and bonded with Adamantium. After being raised in captivity, Laura Kinney emerged as the ultimate assassin, dubbed X-23. Breaking free from her captors, Laura now fights to forge her own legacy as the All-New Wolverine.", "sb": 4, "st": "Frenzy", "name": "Wolverine (X-23)", "sd": "Anytime the opponent has {0} or more Bleed stacks or Wolverine has {0} or more Cruelty stacks, her assassin training kicks in, telling her to finish them off, increasing Critical Hit Rate and Critical Damage by [16982bff]{1}%[-].", "sn": [3, 0], "video": "nQs6Sm51Klc", "sm": 1.6593}, "voodoo": {"bio": "Jericho Drumm was born to a poor area of Haiti. He found his escape, travelling to America to attend school, but returned when his brother Daniel became seriously ill, and died. Respecting his brother’s dying wish, Jericho sought out the Houngan Voodoo Priest that trained his brother. Jericho soon became a Supreme Houngan in his own right, with his pure heart and mystical strength leading him to eventually take the mantle of Doctor Voodoo, new Sorcerer Supreme.", "sb": 50, "st": "Brother Daniel", "viode": "8U85y-vZ2Z8", "name": "Doctor Voodoo", "sd": "Brother Daniel will possess either Doctor Voodoo or his opponent moving between them based on Doctor Voodoo's combo meter when he uses a Special Attack.\nCombo Even: Doctor Voodoo is possessed gaining 100% increased Ability Accuracy and [16982bff]{1}%[-] increased Buff Duration.\nOdd Combo: Opponent is possesed gaining 50% decreased Ability Accuracy and [16982bff]{1}%[-] increased Debuff Duration.", "sn": [0, 0], "sm": 7.5422}, "abomination": {"bio": "When Russian spy Emil Blonksy exposed himself to gamma radiation, he was transformed forever into the monstrous Abomination! Bigger than the Hulk, the Abomination retains his cunning and intellect – but cannot return to his human form. Enormous, powerful, and angry, the Abomination is a fearsome foe – even to one as strong as the Hulk!", "sb": 3, "st": "Irradiate", "name": "Abomination", "sd": "Contact with the Abomination's gamma-irradiated body has a [16982bff]{0}%[-] chance to Poison the target, reducing their Health recovery by 30% and dealing {1}% of your Attack as direct damage over {2} seconds.", "sn": [0, 62, 12], "sm": 1.8101}, "jessica_jones": {"name": "Jessica Jones", "video": "XGL54D-sueM"}, "dr_strange_mn": {"name": "Doctor Strange (Marvel Now!)", "bio": "With our entire world in imminent danger, Doctor Stephen Strange, the Sorcerer Supreme, went on a fateful journey to obtain power that could surpass all other magic. His quest led him to the Sinner’s Market, a secret bazaar specializing in magical items related to the dark arts. Eventually he stumbled upon an object of immense mystical energy that required part of one’s soul in exchange for god-like power. Doctor Strange traded the entirety of his soul and for a time wielded unimaginable magical might, enough to wipe out armies and level entire planets!", "video": "nrYu3z608rI", "st": "Mana Leak", "sd": "The Sorcerer Supreme automatically tears apart enemy beneficial effects with dark magic, leaking opponent’s Power by {1}%. Spell effectiveness: [16982bff]{0}%[-]!"}, "oldman_logan": {"bio": "In an alternate timeline, the villains of Earth and beyond worked together to bring about the downfall of Super Heroes everywhere. Manipulated into hurting his fellow mutants, Wolverine took on a vow of pacifism, swearing to never again pop his claws. 50 years later, when an old friend knocked on his door asking for help on a mission to overthrow the ruling villains, Logan chose to once again do what he did best.", "sb": 10, "st": "Pop the Claws", "name": "Oldman Logan", "sd": "When Logan pops his claws for a Special Attack, each attack has a [16982bff]{0}%[-] chance to cause an additional Bleed for each charge of Pacifism he has at the time, inflicting {1}% of your attack as direct damage over {2} seconds.", "sn": [0, 50, 3], "video": "gOnetzm2tig", "sm": 2.2627}, "mordo": {"bio": "An advanced student of the mystic arts and fellow pupil of The Ancient One, Karl Mordo saw the potential in the fledgling apprentice Stephen Strange and took him under his wing when the one-time neurosurgeon first sought healing. Like Strange, Mordo came to Kamar-Taj lost and broken. The Ancient One helped channel Mordo’s anger and lead him down the path to enlightenment. While Mordo sees a bit of himself in Strange, his reason for vetting him is much shrewder – in the fight against unknowable darkness, Kamar-Taj needs all the help it can muster.", "sb": 40, "st": "Mystical Barrier", "name": "Mordo", "sd": "By conjuring a magical barrier, Mordo's Resists [16982bff]{1}%[-] of any Energy Damage attacks and debuffs.", "sn": [0, 0], "video": "qD7DkqKpR2g", "sm": 6.0338}, "the_vision": {"bio": "The synthetic humanoid known as the Vision possesses a sophisticated artificial intelligence that delivers superior strategy in the heat of battle. His synthezoid body delivers super strength, flight, intangibility, and energy blasts. Although he may not be human, the Vision nobly stands shoulder-to-shoulder with the Avengers against overwhelming odds!", "sb": 12, "st": "Power Steal", "name": "Vision (Age of Ultron)", "sd": "Special Attacks have a [16982bff]{0}%[-] chance to disrupt the target, taking [16982bff]{1}%[-] of their Power as your own.", "sn": [100, 0], "sm": 2.41}, "hulk": {"bio": "PUNY HUMAN! Stop pestering Hulk with dumb questions! Stupid Banner walk into Gamma Bomb blast! Now not just Banner – but HULK! Hulk will slam, crush, and destroy all puny humans! Hulk is the strongest there is! None shall defeat Hulk!", "sb": 40, "st": "Hulk Rage", "name": "Hulk", "sd": "Hulk is angered by receiving damage, strengthening his attacks by up to [16982bff]{1}%[-] based on lost Health. You wouldn't like him when he's angry!", "sn": [0, 0], "sm": 23.57}, "ultron": {"bio": "“What is this? What is this place? This...Contest? I wasn't always here, in this place. I was asleep...or perhaps I was a dream. But now I'm here and on mission. I am Ultron, created by Stark to bring about peace in our time. But humanity cannot be saved in its current state. No, we need a new world to supplant humanity. A world of metal. I’ll create peace in the only way it can be achieved. Not in Stark’s way, but in my own. How is humanity saved if it's not allowed to evolve?”", "sb": 20, "st": "Absorption", "name": "Ultron", "sd": "Energy attacks only serve Ultron, who converts [16982bff]{1}%[-] of the damage into both Power and Health.", "sn": [0, 0], "sm": 6.935}, "nightcrawler": {"bio": "Raised from childhood in an Eastern European circus, Half-Demon Mutant Kurt Wagner has always existed on the outside. Gifted with the power to teleport at will, but marred with his father’s demonic appearance, Kurt eventually found a place for himself amongst Xavier’s X-Men. Despite his intimidating outward appearance, Nightcrawler remains positive and optimistic, always using his powers for the betterment of both mankind and mutantkind.", "sb": 15, "st": "Neyaphem Heritage", "name": "Nightcrawler", "sd": "Nightcrawler’s unique heritage, coupled with his X-Men training allows him to switch combat mode {0} seconds faster. Additionally, anytime he strikes a Deep Wound, he gains [16982bff]{1}%[-] increased Attack for {2} seconds.", "sn": [0.3, 0, 7], "video": "G7QlRhkjI4U", "sm": 3.0169}, "agent_venom": {"bio": "Eugene “Flash” Thompson, long-time fan of Spider-Man and friend of Peter Parker, thought his career was over when he lost his legs fighting in the Iraq War. Desperate for another opportunity to help others, Flash enrolled in Project Rebirth and soon found himself bound to the alien Symbiote Venom. Now possessing many of the same powers as his wall-crawling hero, Flash works for the U.S government as the deadly Agent Venom.", "sb": 8, "st": "Klyntar Rage", "name": "Agent Venom", "sd": "At the beginning of the fight, and whenever Flash loses {0}% of his Max Health, he temporarily loses control of the Venom symbiote, increasing Attack and Critical Damage by [16982bff]{1}%[-]. This effect is lost once he is struck {2} times.", "sn": [50, 0, 5], "video": "Au-tU-nI_H4", "sm": 3.6203}, "spiderman_black": {"bio": "One of Peter Parker’s most famous and notorious costumes enters The Contest to unleash its alien powers. Cosmic in origins, this dark version of Spidey’s suit has a mind of its own.", "sb": 15, "st": "Symbiotic Enhancement", "name": "Spider-Man (Symbiote)", "sd": "The strange alien Symbiote grants Spider-Man enhanced Spider Senses whenever he activates a special attack, granting [16982bff]{0}%[-] Evasion for {2} seconds.", "sn": [0, 0, 8], "video": "iK4VrbBSqiY", "sm": 3.7711}, "juggernaut": {"bio": "Cain Marko was a bitter man with a big chip on his shoulder. His story could have ended harmlessly, but then disaster struck: a mystic artifact transformed him into the unstoppable Juggernaut! Since then, he's made it his mission to torment the Marvel Universe with his strength, resilience, and nasty attitude!", "sb": 1.6, "st": "Unstoppable", "name": "Juggernaut", "sd": "Juggernaut becomes Unstoppable for [16982bff]{2}[-] seconds, shrugging off enemy attacks. Once Juggernaut starts moving, nothing can stop him!", "sn": [0, 0, 0], "sm": 0.21}}